In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('sugar-cane-production.csv')

In [4]:
df

,Entity,Code,Year,Sugar cane | 00000156 || Production | 005510 || tonnes
0,Afghanistan,AFG,1961,45000.0
1,Afghanistan,AFG,1962,45000.0
2,Afghanistan,AFG,1963,45000.0
3,Afghanistan,AFG,1964,45000.0
4,Afghanistan,AFG,1965,51000.0
...,...,...,...,...
8937,Zimbabwe,ZWE,2019,5562674.0
8938,Zimbabwe,ZWE,2020,5860931.0
8939,Zimbabwe,ZWE,2021,5886527.0
8940,Zimbabwe,ZWE,2022,5116000.0
8941,Zimbabwe,ZWE,2023,5670265.5

In [6]:
df = df.rename(columns={"Sugar cane | 00000156 || Production | 005510 || tonnes":"Production(tonnes)"})

In [7]:
df.head()

        Entity Code  Year  Production(tonnes)
0  Afghanistan  AFG  1961             45000.0
1  Afghanistan  AFG  1962             45000.0
2  Afghanistan  AFG  1963             45000.0
3  Afghanistan  AFG  1964             45000.0
4  Afghanistan  AFG  1965             51000.0

In [8]:
df.columns

Index(['Entity', 'Code', 'Year', 'Production(tonnes)'], dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8942 entries, 0 to 8941
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Entity              8942 non-null   object
 1   Code                6590 non-null   object
 2   Year                8942 non-null   int64
 3   Production(tonnes)  8942 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 279.6+ KB